SunCity/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <attributes>
    <name>ПредставлениеШтрихкода</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.Справки2ЕГАИС</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/ChartsOfCharacteristicTypes/ТипыШтрихкодов/ТипыШтрихкодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ТипыШтрихкодов</name>
  <type>
    <types>String</types>
    <stringQualifiers>
      <length>200</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>CODE128</name>
      <description>CODE128</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>CODE39</name>
      <description>CODE39</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>39</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>EAN128</name>
      <description>EAN128</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>EAN13</name>
      <description>EAN13</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>EAN8</name>
      <description>EAN8</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ITF14</name>
      <description>ITF14</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

SunCity/src/CommonModules/РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйПереопределяемый/Module.bsl
#Область Штрихкодирование

 Функция ТипШтрихкода(Штрихкод) Экспорт
	
	ТипШтрихкодаРТ = Неопределено;
	
	ТипШтрихкодаРТ   = ПланыВидовХарактеристик.ТипыШтрихкодов.ПустаяСсылка();
	ТипШтрихкодаВрем = МенеджерОборудованияВызовСервера.ОпределитьТипШтрихкода(Штрихкод);
	
	Если ТипШтрихкодаВрем = "EAN8" Тогда
		ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8;
	ИначеЕсли ТипШтрихкодаВрем = "EAN13" Тогда
		ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
	ИначеЕсли ТипШтрихкодаВрем = "EAN128" Тогда
		ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN128;
	ИначеЕсли ТипШтрихкодаВрем = "CODE39" Тогда
		ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.CODE39;
	ИначеЕсли ТипШтрихкодаВрем = "CODE128" Тогда
		ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.CODE128;
	ИначеЕсли ТипШтрихкодаВрем = "ITF14" Тогда
		ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.ITF14;
	КонецЕсли;
	
	Возврат ТипШтрихкодаРТ;
	
КонецФункции

Функция ПодобратьGTINДляЗаказа(Номенклатура, Упаковка, Характеристика, ХарактеристикиИспользуются, ЭтоТабак = Ложь) Экспорт
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры  	
    |ГДЕ
	|	ШтрихкодыНоменклатуры.Владелец = &Номенклатура
	|	<Характеристики>
	|	<Упаковка>";
	
	Если ХарактеристикиИспользуются Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<Характеристики>", "И ШтрихкодыНоменклатуры.Характеристика = &Характеристика");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<Характеристики>", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Упаковка) Тогда//Для всех ТГ учитываем упаковку только если она есть и не равна штучной упаковке (коэф-т 1)
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<Упаковка>", "И ШтрихкодыНоменклатуры.Упаковка = &Упаковка");
	Иначе
		Если ЭтоТабак Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<Упаковка>", "И ШтрихкодыНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)");	
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "<Упаковка>", "");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Если ХарактеристикиИспользуются Тогда
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
	КонецЕсли;
	Если ЗначениеЗаполнено(Упаковка) Тогда
		Запрос.УстановитьПараметр("Упаковка", Упаковка);
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	МассивШтрихкодов = Новый Массив();
	Пока Выборка.Следующий() Цикл
		МассивШтрихкодов.Добавить(РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.GTINПоШтрихкодуEAN(Выборка.Штрихкод));
	КонецЦикла;

	Возврат МассивШтрихкодов;
	
КонецФункции

#КонецОбласти
